### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_profile will be created
+   resource "aws_iam_instance_profile" "ec2_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "safal-default-ec2-profile"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "safal-default-ec2-s3-role"
+       tags        = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-ec2-profile"
        }
+       tags_all    = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-ec2-profile"
        }
+       unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_s3_role will be created
+   resource "aws_iam_role" "ec2_s3_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "safal-default-ec2-s3-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-ec2-s3-role"
        }
+       tags_all              = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-ec2-s3-role"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_instance.myinstance will be created
+   resource "aws_instance" "myinstance" {
+       ami                                  = "ami-05ffe3c48a9991133"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = "safal-default-ec2-profile"
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "safal-encryption-key"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       region                               = "us-east-1"
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-0fdfb5252ab10392f"
+       tags                                 = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-EC2"
        }
+       tags_all                             = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-EC2"
        }
+       tenancy                              = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

  # aws_s3_bucket.mybucket will be created
+   resource "aws_s3_bucket" "mybucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "com.safal-default-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-tf-bucket"
        }
+       tags_all                    = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-tf-bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # aws_s3_bucket_versioning.versioning_safal will be created
+   resource "aws_s3_bucket_versioning" "versioning_safal" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       region = "us-east-1"

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # aws_security_group.secgrp will be created
+   resource "aws_security_group" "secgrp" {
+       arn                    = (known after apply)
+       description            = "secgrp_for_ec2"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "safal-default-my_secgrp"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       region                 = "us-east-1"
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-secgrp"
        }
+       tags_all               = {
+           "Creator" = "Safal Karki"
+           "Name"    = "safal-default-secgrp"
        }
+       vpc_id                 = "vpc-0eb2d01c37cc93e40"
    }

  # aws_vpc_security_group_egress_rule.allow_all_egress will be created
+   resource "aws_vpc_security_group_egress_rule" "allow_all_egress" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       region                 = "us-east-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.allow_icmp will be created
+   resource "aws_vpc_security_group_ingress_rule" "allow_icmp" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       from_port              = -1
+       id                     = (known after apply)
+       ip_protocol            = "icmp"
+       region                 = "us-east-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
+       to_port                = -1
    }

  # aws_vpc_security_group_ingress_rule.rule_for_web will be created
+   resource "aws_vpc_security_group_ingress_rule" "rule_for_web" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       from_port              = 80
+       id                     = (known after apply)
+       ip_protocol            = "tcp"
+       region                 = "us-east-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
+       to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.ssh_rule will be created
+   resource "aws_vpc_security_group_ingress_rule" "ssh_rule" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       from_port              = 22
+       id                     = (known after apply)
+       ip_protocol            = "tcp"
+       region                 = "us-east-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags_all               = {}
+       to_port                = 22
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>